"common.ok" = "ОК";
"common.cancel" = "Отмена";
"common.save" = "Сохранить";
"common.done" = "Готово";
"common.na" = "н/д";
"app.language" = "app.language";

"language.section" = "Язык";
"language.system" = "Системный";
"language.english" = "Английский";
"language.russian" = "Русский";

"panel.title" = "Симулятор цифрового двойника БПЛА";
"panel.keyboard_hint" = "WASD/QE полет, Shift ускорение, 1..5 камеры, стрелки только FPV, +/- зум";
"panel.workflow_hint" = "Основные команды находятся в верхней ленте. Показывайте и скрывайте параметры кнопками панели.";
"panel.toggle_collapse" = "Свернуть/развернуть панель";
"panel.collapse" = "Свернуть панель";
"panel.expand" = "Развернуть панель";
"panel.parameters.on" = "Параметры: Вкл";
"panel.parameters.off" = "Параметры: Выкл";
"panel.hide" = "Скрыть панель параметров";
"panel.show" = "Показать панель параметров";
"panel.drone_profile" = "Профиль БПЛА";
"panel.model" = "Модель";
"panel.mass" = "Масса";
"panel.max_flight" = "Макс. полет";
"panel.max_wind" = "Сопротивление ветру";
"panel.camera_layout" = "Камерный модуль";
"panel.visual_class" = "Визуальный класс";
"panel.commands" = "Команды";
"panel.position" = "Положение";
"panel.orientation" = "Ориентация";
"panel.throttle" = "Тяга";
"panel.camera" = "Камера";
"panel.camera_mode" = "Режим камеры";
"panel.weather" = "Погода";
"panel.terrain" = "Местность";
"panel.diagnostics" = "Диагностика";
"panel.fleet" = "Группа";
"panel.damage" = "Повреждения и состояние";
"panel.warnings" = "Предупреждения";
"panel.telemetry" = "Телеметрия";

"axis.x" = "X";
"axis.y" = "Y";
"axis.z" = "Z";
"axis.roll" = "Крен";
"axis.pitch" = "Тангаж";
"axis.yaw" = "Рыскание";

"camera.mode.free" = "Свободная";
"camera.mode.follow" = "Вид от хвоста";
"camera.mode.fpv" = "FPV";
"camera.mode.orbit" = "Орбита";
"camera.mode.top" = "Вид сверху";
"camera.fov" = "Угол обзора";
"camera.sensitivity" = "Чувствительность";
"camera.smoothing" = "Сглаживание";
"camera.orbit_distance" = "Дистанция орбиты";
"camera.follow_x" = "Смещение следования X";
"camera.follow_y" = "Смещение следования Y";
"camera.follow_z" = "Смещение следования Z";
"camera.fpv_stabilization" = "FPV стабилизация";
"camera.fpv_shake" = "FPV дрожание";

"command.reset" = "Сброс";
"command.takeoff" = "Взлет";
"command.land" = "Посадка";
"command.hover" = "Зависнуть";
"command.auto_path" = "Авто-маршрут";
"command.return_home" = "Возврат домой";
"command.emergency_stop" = "Аварийная остановка";
"command.start_animation" = "Запустить симуляцию";
"command.stop_animation" = "Остановить симуляцию";

"weather.normal" = "Норма";
"weather.wind" = "Ветер";
"weather.rain" = "Дождь";
"weather.snow" = "Снег";
"weather.fog" = "Туман";
"weather.smog" = "Смог";
"weather.thunderstorm" = "Гроза";
"weather.intensity" = "Интенсивность";
"weather.wind_direction" = "Направление ветра";
"weather.wind_speed" = "Скорость ветра";
"weather.gusts" = "Порывы";

"terrain.grid_demo" = "Сетка (демо)";
"terrain.field" = "Поле";
"terrain.forest" = "Лес";
"terrain.city" = "Город";
"terrain.density" = "Плотность объектов";
"terrain.seed" = "Сид";
"terrain.scale" = "Масштаб карты";
"terrain.scale.4x4" = "4x4";
"terrain.scale.8x8" = "8x8";
"terrain.scale.16x16" = "16x16";
"terrain.scale.32x32" = "32x32";

"diagnostic.mode" = "Режим диагностики";
"diagnostic.mode.normal" = "Обычный вид";
"diagnostic.mode.thermal" = "Тепло / Нагрузка";
"diagnostic.mode.damage" = "Повреждения / Целостность";
"diagnostic.collision_debug" = "Отладка коллизий";
"diagnostic.fleet_mode" = "Включить группу";

"fleet.formation" = "Построение";
"fleet.mode.off" = "Выкл";
"fleet.mode.line" = "Линия";
"fleet.mode.triangle" = "Треугольник";
"fleet.separation" = "Интервал";
"fleet.wingmen" = "Ведомые";
"fleet.risk" = "Риск между дронами";
"fleet.nearest" = "Минимальная дистанция";

"damage.reset" = "Сбросить повреждения";
"damage.clear_selection" = "Снять выбор";
"damage.hide" = "Скрыть";

"component.battery" = "Батарея";
"component.gimbal" = "Передняя камера / подвес";
"component.fc_core" = "Ядро полетного контроллера";
"component.motor_fl" = "Мотор FL";
"component.motor_fr" = "Мотор FR";
"component.motor_rl" = "Мотор RL";
"component.motor_rr" = "Мотор RR";
"component.propeller_fl" = "Пропеллер FL";
"component.propeller_fr" = "Пропеллер FR";
"component.propeller_rl" = "Пропеллер RL";
"component.propeller_rr" = "Пропеллер RR";
"component.arm_fl" = "Луч FL";
"component.arm_fr" = "Луч FR";
"component.arm_rl" = "Луч RL";
"component.arm_rr" = "Луч RR";
"component.esc_power" = "ESC / силовая электроника";

"warning.nominal" = "Норма";
"warning.warning" = "Внимание";
"warning.critical" = "Критично";
"warning.collision_high" = "Высокий риск столкновения";
"warning.weather_severe" = "Сложные погодные условия";
"warning.battery_low" = "Низкий заряд батареи";
"warning.integrity_low" = "Низкая структурная целостность";
"warning.fixedwing_low_speed" = "Низкая скорость fixed-wing / риск сваливания";
"warning.fleet_risk" = "Риск в построении группы";
"warning.interdrone_critical" = "Критическое сближение дронов";
"warning.emergency" = "Активирован аварийный режим";
"warnings.none" = "Активных предупреждений нет";
"summary.damage.none" = "Критичных повреждений нет";

"telemetry.position" = "Координаты";
"telemetry.velocity" = "Скорость (вектор)";
"telemetry.attitude" = "Ориентация";
"telemetry.speed" = "Скорость";
"telemetry.throttle" = "Тяга";
"telemetry.mode" = "Режим";
"telemetry.state" = "Состояние";
"telemetry.battery" = "Батарея";
"telemetry.power" = "Потребление";
"telemetry.remaining" = "Осталось";
"telemetry.weather" = "Погода";
"telemetry.collision_risk" = "Риск столкновения";
"telemetry.nearest_obstacle" = "Ближайшее препятствие";
"telemetry.emergency" = "Аварийное действие";
"telemetry.damage" = "Повреждения";
"telemetry.thermal" = "Тепловая сводка";
"telemetry.fleet" = "Режим группы";
"telemetry.fleet_risk" = "Риск группы";
"telemetry.nearest_interdrone" = "Ближайший междроновый";
"telemetry.export" = "Экспорт телеметрии";
"telemetry.export.success" = "Телеметрия экспортирована";
"telemetry.export.failure" = "Ошибка экспорта телеметрии";

"hud.title" = "HUD телеметрии";
"hud.telemetry" = "Телеметрия";
"hud.camera" = "Камера";
"hud.drone" = "Дрон";

"mode.manual" = "Ручной";
"mode.auto_path" = "Авто-маршрут";
"mode.return_home" = "Возврат домой";
"mode.hover" = "Зависание";
"mode.emergency_stop" = "Аварийная остановка";
"mode.takeoff" = "Взлет";
"mode.landing" = "Посадка";

"flight_state.on_ground" = "На земле";
"flight_state.battery_depleted" = "Батарея разряжена";
"flight_state.ascending" = "Набор высоты";
"flight_state.descending" = "Снижение";
"flight_state.emergency" = "Авария";
"flight_state.stable" = "Стабильно";
"flight_state.climbing" = "Подъем";
"flight_state.cruise" = "Крейсерский";

"emergency.none" = "Нет";
"emergency.slow_down" = "Снизить скорость";
"emergency.hover" = "Зависнуть";
"emergency.avoid" = "Обход";
"emergency.stop" = "Аварийная остановка";

"battery.depleted.title" = "Батарея разряжена";
"battery.depleted.message" = "Заряд полностью исчерпан. Выберите действие для продолжения.";
"battery.depleted.charge" = "Зарядить дрон";
"battery.depleted.restart" = "Перезапустить сценарий";

"abstract.edit" = "Редактировать параметры";
"abstract.editor.title" = "Параметры Abstract UAV";
"abstract.editor.mass" = "Масса";
"abstract.editor.dimensions" = "Габариты";
"abstract.editor.energy" = "Энергия и ограничения";
"abstract.editor.control" = "Управляемость";
"abstract.validation.vertical" = "Скорость набора/снижения слишком мала.";
"abstract.validation.speed" = "Горизонтальная скорость должна быть >= вертикальных.";
"abstract.validation.radius" = "Радиус коллизии слишком велик для выбранных габаритов.";

"drone.model.lipo_scout4" = "LIPO Scout 4";
"drone.model.lipo_vector3s" = "LIPO Vector 3S";
"drone.model.lipo_atlas3pro" = "LIPO Atlas 3 Pro";
"drone.model.abstract" = "Abstract UAV";

"drone.visual.mini" = "Легкий компактный квадрокоптер";
"drone.visual.vector" = "Средний квадрокоптер с двумя камерами";
"drone.visual.atlas" = "Крупный профессиональный квадрокоптер";
"drone.visual.abstract" = "Пользовательский абстрактный профиль";

"drone.camera.single_compact" = "Один компактный фронтальный подвес";
"drone.camera.dual_front" = "Двойной фронтальный камерный модуль";
"drone.camera.triple_front" = "Тройной фронтальный камерный модуль";
"drone.camera.custom" = "Пользовательский редактируемый модуль";

"ui.toggle_telemetry_hud" = "Переключить компактный HUD";

"camera.zoom_sensitivity" = "Чувствительность зума";
"camera.free_speed" = "Скорость свободной камеры";
"camera.distance" = "Дистанция камеры";
"camera.fpv_yaw_limit" = "Лимит FPV рыскания";
"camera.fpv_pitch_limit" = "Лимит FPV тангажа";
"camera.fpv_near_clip" = "FPV ближняя отсечка";
"camera.fpv_mount_x" = "FPV крепление X";
"camera.fpv_mount_y" = "FPV крепление Y";
"camera.fpv_mount_z" = "FPV крепление Z";
"camera.fpv_hide_obstructing" = "Скрывать мешающие части дрона в FPV";

"keybind.section.title" = "Назначения клавиш";
"keybind.open" = "Бинды";
"keybind.category.flight" = "Управление полетом";
"keybind.category.camera" = "Управление камерой";
"keybind.category.ui" = "Управление интерфейсом";
"keybind.category.debug" = "Отладка / оверлеи";
"keybind.flight.forward" = "Вперед";
"keybind.flight.backward" = "Назад";
"keybind.flight.left" = "Влево";
"keybind.flight.right" = "Вправо";
"keybind.flight.descend" = "Снижение";
"keybind.flight.ascend" = "Набор высоты";
"keybind.flight.yaw_left" = "Рыскание влево";
"keybind.flight.yaw_right" = "Рыскание вправо";
"keybind.flight.accelerate" = "Ускорение";
"keybind.flight.hover" = "Зависание / стабилизация";
"keybind.flight.reset" = "Сброс дрона";
"keybind.camera.mode1" = "Камера 1 (Свободная)";
"payload.select" = "Выбор полезной нагрузки";
"payload.placeholder.message" = "Функция будет добавлена позже.";
"control_mode.angle" = "Angle";
"command.arm" = "Arm";
"command.disarm" = "Disarm";
"telemetry.arm_state" = "Состояние Arm";
"arm_state.armed" = "Armed";
"arm_state.disarmed" = "Disarmed";
"flight_state.disarmed" = "Disarmed";
"flight_state.armed_idle" = "Armed Idle";
"flight_state.crashed" = "Крушение";
"warning.disarmed" = "Аппарат разармлен";
"warning.integrity_critical" = "Критическое повреждение конструкции";
"warning.crashed" = "Аппарат потерпел крушение";
"damage.severity.nominal" = "Норма";
"damage.severity.light" = "Легкие";
"damage.severity.medium" = "Средние";
"damage.severity.critical" = "Критические";
"keybind.camera.mode2" = "Камера 2 (Хвост)";
"keybind.camera.mode3" = "Камера 3 (Орбита)";
"keybind.camera.mode4" = "Камера 4 (FPV)";
"keybind.camera.mode5" = "Камера 5 (Сверху)";
"keybind.camera.toggle_fpv" = "Переключить FPV";
"keybind.camera.cycle_mode" = "Смена режима камеры";
"keybind.camera.zoom_in" = "Приблизить";
"keybind.camera.zoom_out" = "Отдалить";
"keybind.camera.yaw_left" = "Камера: влево";
"keybind.camera.yaw_right" = "Камера: вправо";
"keybind.camera.pitch_up" = "Камера: вверх";
"keybind.camera.pitch_down" = "Камера: вниз";
"keybind.camera.reset_orientation" = "Сброс ориентации камеры";
"workspace.toolstrip" = "Лента инструментов";
"toolstrip.tab.simulation" = "Симуляция";
"toolstrip.tab.flight" = "Полет";
"toolstrip.tab.camera" = "Камера";
"toolstrip.tab.environment" = "Окружение";
"toolstrip.tab.debug" = "Отладка";
"toolstrip.tab.projects" = "Проекты";
"toolstrip.section.run" = "Управление запуском";
"toolstrip.section.flight_model" = "Аппарат и режим";
"toolstrip.section.throttle" = "Тяга";
"toolstrip.section.camera_modes" = "Режимы камеры";
"toolstrip.section.camera_quick" = "Пресеты камеры";
"toolstrip.section.weather" = "Погода";
"toolstrip.section.terrain" = "Местность";
"toolstrip.section.debug" = "Диагностика";
"toolstrip.section.projects" = "Действия проекта";
"camera.zoom_in" = "Приблизить";
"camera.zoom_out" = "Отдалить";
"camera.reset_orientation" = "Сбросить вид";
"panel.collision_debug" = "Отладка коллизий";
"window.fullscreen" = "Полный экран";
"keybind.ui.toggle_panel" = "Свернуть / развернуть панель";
"keybind.ui.toggle_hud" = "Переключить HUD телеметрии";
"keybind.debug.toggle_damage" = "Переключить оверлей повреждений";
"keybind.debug.toggle_thermal" = "Переключить тепловой оверлей";
"keybind.capture.idle" = "Выберите действие и нажмите переназначение.";
"keybind.capture.prompt" = "Нажмите клавишу для \"%@\" (Esc для отмены)";
"keybind.rebind" = "Переназначить";
"keybind.capturing" = "Ожидание…";
"keybind.reset_defaults" = "Сброс по умолчанию";

"control_mode.title" = "Режим управления полетом";
"control_mode.stabilized" = "Стабилизированный";
"control_mode.acro" = "Акро";
"control_mode.hover_assist" = "Удержание высоты";

"common.export" = "Экспорт";

"camera.preset" = "Пресет камеры";
"camera.preset.cinematic" = "Кинематографичный";
"camera.preset.pilot" = "Пилот";
"camera.preset.inspection" = "Инспекция";
"camera.preset.wide_follow" = "Широкое следование";
"camera.preset.tight_follow" = "Близкое следование";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Сбросить к пресету";
"camera.advanced" = "Расширенные настройки камеры";
"camera.invert_x" = "Инвертировать X";
"camera.invert_y" = "Инвертировать Y";
"camera.sensitivity_profile" = "Профиль чувствительности";
"camera.sensitivity.low" = "Низкий";
"camera.sensitivity.medium" = "Средний";
"camera.sensitivity.high" = "Высокий";

"section.flight" = "Полет";
"section.camera" = "Камера";
"section.environment" = "Среда";
"section.diagnostics" = "Диагностика";
"section.advanced" = "Расширенные";

"diagnostic.last_collision_source" = "Источник последней коллизии";
"diagnostic.active_objects" = "Активные объекты";
"diagnostic.active_physics" = "Физические тела";
"diagnostic.active_particles" = "Частицы";

"telemetry.control_mode" = "Режим управления";
"telemetry.nearest_obstacle_source" = "Источник ближайшего препятствия";
"telemetry.frame_time" = "Кадр";
"telemetry.physics_time" = "Физика";
"telemetry.render_time" = "Рендер";
"telemetry.path_time" = "Планировщик";
"telemetry.active_objects" = "Объекты";
"telemetry.active_physics_bodies" = "Физические тела";
"telemetry.particle_count" = "Частицы";

"drone.model.fixed_rect" = "БПЛА с прямым крылом";
"drone.model.fixed_delta" = "БПЛА дельта-крыло";
"drone.model.fixed_swept" = "БПЛА со стреловидным крылом";
"drone.visual.fixed_rect" = "Самолет с прямым крылом";
"drone.visual.fixed_delta" = "Самолет дельта-крыло";
"drone.visual.fixed_swept" = "Самолет со стреловидным крылом";
"drone.camera.fixed_front" = "Фиксированная фронтальная камера";

"menu.title" = "Проекты БПЛА";
"menu.saved_projects" = "Сохраненные проекты";
"menu.create_project" = "Создать проект";
"menu.recent_project" = "Последний проект";
"menu.search" = "Поиск проекта";
"menu.sort" = "Сортировка";

"project.name" = "Имя проекта";
"project.sort.newest" = "Сначала новые";
"project.sort.name" = "По имени";
"project.sort.recent" = "Недавно открытые";
"project.create.title" = "Создание проекта";
"project.create.action" = "Создать";
"project.open.action" = "Открыть список проектов";
"project.open.failure" = "Не удалось открыть проект";
"project.save.action" = "Сохранить проект";
"project.save_as.action" = "Сохранить как";
"project.save_as.title" = "Сохранить проект как";
"project.save.success" = "Проект сохранен";
"project.save.failure" = "Ошибка сохранения проекта";
"project.duplicate.title" = "Дублировать проект";
"project.duplicate.action" = "Дублировать проект";
"project.duplicate.success" = "Проект продублирован";
"project.duplicate.failure" = "Ошибка дублирования проекта";
"project.delete.action" = "Удалить проект";
"project.delete.failure" = "Не удалось удалить проект";
"project.delete.confirm.title" = "Удаление проекта";
"project.delete.confirm.message" = "Удалить проект '%@'?";

"project.unsaved.title" = "Несохраненные изменения";
"project.unsaved.message" = "Сохранить проект '%@'?\nНесохраненные изменения могут быть потеряны.";
"project.unsaved.save" = "Сохранить";
"project.unsaved.save_exit" = "Сохранить и выйти";
"project.unsaved.exit_without" = "Выйти без сохранения";

"telemetry.export.select_folder" = "Выберите папку для экспорта файла телеметрии.";
"control_mode.acro" = "Acro / Rate";
"control_mode.hover_assist" = "Hover / Alt-Hold";

"section.flight" = "Полет";
"section.camera" = "Камера";
"section.environment" = "Окружение";
"section.diagnostics" = "Диагностика";
"section.advanced" = "Расширенные";

"camera.preset" = "Пресет камеры";
"camera.preset.cinematic" = "Кинематограф";
"camera.preset.pilot" = "Пилот";
"camera.preset.inspection" = "Инспекция";
"camera.preset.wide_follow" = "Широкое следование";
"camera.preset.tight_follow" = "Плотное следование";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Сброс к пресету";
"camera.advanced" = "Расширенная камера";
"camera.sensitivity_profile" = "Профиль чувствительности";
"camera.sensitivity.low" = "Низкий";
"camera.sensitivity.medium" = "Средний";
"camera.sensitivity.high" = "Высокий";
"camera.invert_x" = "Инвертировать X";
"camera.invert_y" = "Инвертировать Y";

"diagnostic.last_collision_source" = "Источник последнего столкновения";
"diagnostic.active_objects" = "Активные объекты";
"diagnostic.active_physics" = "Активные физические тела";
"diagnostic.active_particles" = "Количество частиц";

"telemetry.control_mode" = "Режим управления";
"telemetry.nearest_obstacle_source" = "Источник ближайшего препятствия";
"telemetry.frame_time" = "Время кадра";
"telemetry.physics_time" = "Время физики";
"telemetry.render_time" = "Время рендера";
"telemetry.path_time" = "Время поиска пути";
"telemetry.active_objects" = "Активные объекты";
"telemetry.active_physics_bodies" = "Физические тела";
"telemetry.particle_count" = "Частицы";

"drone.model.fixed_rect" = "БПЛА с прямым крылом";
"drone.model.fixed_delta" = "БПЛА с дельта-крылом";
"drone.model.fixed_swept" = "БПЛА со стреловидным крылом";

"drone.visual.fixed_rect" = "Семейство fixed-wing с прямым крылом";
"drone.visual.fixed_delta" = "Семейство fixed-wing с дельта-крылом";
"drone.visual.fixed_swept" = "Семейство fixed-wing со стреловидным крылом";

"drone.camera.fixed_front" = "Фронтальная камера fixed-wing";
